---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFileModelOptions.#ctor
source: html/55e1d788-5ad5-d0ec-5dda-ec29d3341986.htm
---
# Autodesk.Revit.DB.IFC.IFCFileModelOptions.#ctor Method

Creates a default IFCFileModelOptions. The default schema file is empty and cache size is 8192.

## Syntax (C#)
```csharp
public IFCFileModelOptions()
```